## Target Ordinal Encoding

In [1]:
import pandas as pd
df = pd.DataFrame({
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'price': [200,150,300,180,320]
})

In [2]:
df

          city  price
0     New York    200
1  Los Angeles    150
2      Chicago    300
3      Houston    180
4      Phoenix    320

In [5]:
mean_price=df.groupby('city') ['price'].mean()

In [6]:
mean_price

city
Chicago        300.0
Houston        180.0
Los Angeles    150.0
New York       200.0
Phoenix        320.0
Name: price, dtype: float64

In [7]:
df['city_encoded']=df['city'].map(mean_price)

In [8]:
df

          city  price  city_encoded
0     New York    200         200.0
1  Los Angeles    150         150.0
2      Chicago    300         300.0
3      Houston    180         180.0
4      Phoenix    320         320.0